{
    "url": "https://www.nytimes.com/2022/08/01/business/return-to-office-battles.amp.html",
    "title": "What Remote Work Debate? They've Been Back at the Office for a While.",
    "description": "Cubicles are largely empty in downtown San Francisco and Midtown Manhattan, but workers in America's midsize and small cities are back to their commutes.",
    "links": [
      "https://www.nytimes.com/2022/08/01/business/return-to-office-battles.html",
      "https://www.nytimes.com/2022/08/01/business/return-to-office-battles.amp.html"
    ],
    "image": "https://static01.nyt.com/images/2022/07/31/business/31office-divide-1/31office-divide-1-videoSixteenByNine3000.jpg",
    "content": "&lt;article&gt;\n&lt;p&gt;Cubicles are largely empty in downtown San Francisco and Midtown Manhattan, but workers in America’s midsize and small cities are back to their commutes.&lt;/p&gt;&lt;div&gt;&lt;figure&gt;&lt;div&gt;&lt;picture&gt;&lt;source media=&quot;(max-width: 599px) and (min-device-pixel-ratio: 3),(max-width: 599px) and (-webkit-min-device-pixel-ratio: 3),(max-width: 599px) and (min-resolution: 3dppx),(max-width: 599px) and (min-resolution:\n288dpi)&quot; srcset=&quot;https://static01.nyt.com/images/2022/07/31/business/31office-divide-1/31office-divide-1-mobileMasterAt3x.jpg?quality=75&amp;amp;auto=webp&amp;amp;disable=upscale&amp;amp;width=600&quot;&gt;&lt;/source&gt;&lt;source media=&quot;(max-width: 599px) and (min-device-pixel-ratio: 2),(max-width: 599px) and (-webkit-min-device-pixel-ratio: 2),(max-width: 599px) and (min-resolution: 2dppx),(max-width: 599px) and (min-resolution: 192dpi)&quot; srcset=&quot;https://static01.nyt.com/images/2022/07/31/business/31office-divide-1/31office-divide-1-mobileMasterAt3x.jpg?quality=75&amp;amp;auto=webp&amp;amp;disable=upscale&amp;amp;width=1200&quot;&gt;&lt;/source&gt;&lt;source media=&quot;(max-width: 599px) and (min-device-pixel-ratio: 1),(max-width: 599px) and (-webkit-min-device-pixel-ratio: 1),(max-width: 599px) and (min-resolution: 1dppx),(max-width: 599px) and (min-resolution: 96dpi)&quot; srcset=&quot;https://static01.nyt.com/images/2022/07/31/business/31office-divide-1/31office-divide-1-mobileMasterAt3x.jpg?quality=75&amp;amp;auto=webp&amp;amp;disable=upscale&amp;amp;width=1800&quot;&gt;&lt;/source&gt;&lt;img alt=&quot;The Squire Patton Boggs law office in Columbus, Ohio. More than two years into the pandemic, American corporate workplaces have splintered. Some are nearly as full as they were before Covid-19. Others sit abandoned.&quot; src=&quot;https://static01.nyt.com/images/2022/07/31/business/31office-divide-1/31office-divide-1-articleLarge.jpg?quality=75&amp;amp;auto=webp&amp;amp;disable=upscale&quot; srcset=&quot;https://static01.nyt.com/images/2022/07/31/business/31office-divide-1/31office-divide-1-articleLarge.jpg?quality=75&amp;amp;auto=webp 600w, https://static01.nyt.com/images/2022/07/31/business/31office-divide-1/31office-divide-1-jumbo.jpg?quality=75&amp;amp;auto=webp 1024w, https://static01.nyt.com/images/2022/07/31/business/31office-divide-1/31office-divide-1-superJumbo.jpg?quality=75&amp;amp;auto=webp 2048w&quot; /&gt;&lt;/picture&gt;&lt;/div&gt;&lt;figcaption&gt;&lt;span&gt;&lt;span&gt;Credit...&lt;/span&gt;&lt;span&gt;&lt;span&gt;Ty Wright for\nThe New York Times&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/figcaption&gt;&lt;/figure&gt;&lt;/div&gt;&lt;p&gt;&lt;span&gt;Aug. 1, 2022&lt;/span&gt;&lt;/p&gt;\n&lt;section&gt;&lt;div&gt;&lt;p&gt;The competition for parking space is getting steeper. Commutes are inching longer. Workplace lounges are filling up with commotion as junior associates play cornhole. What return-to-office debate? In some parts of the country, it’s been settled.&lt;/p&gt;&lt;p&gt;“I know almost nobody in Columbus who is fully remote,” said Grant Blosser, 35, who works at a financial services firm.&lt;/p&gt;&lt;p&gt;In October 2020, Mr. Blosser started going back into his office in Columbus,\nOhio, five days a week. He cracked jokes with the young analysts, one of whom recently dragged his team to hot yoga. (It “kicked our butts.”) He listened to his book club’s selection in the car (currently, a biography of Winston Churchill). It was a relief, he said, to feel the “separation of church and state” that came from leaving the house each day.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;“Almost everybody I know is in an office most of the time here,” he said. “The headlines that I read about as far as people\ndragging their feet going back to the office are about select companies and select cities.”&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;More than two years into the pandemic, American corporate workplaces have splintered. Some are nearly as full as they were before Covid-19 struck; others sit abandoned, printers switched off and Keurig cups collecting dust. Workers in America’s midsize and small cities have returned to the office in far greater numbers than those in the biggest U.S. cities. Some executives in large cities\nare hoping they’ll catch up, though they’ve been impeded by safety and health concerns about mass transit commutes, as well as competitive job markets where employees are more likely to call the shots.&lt;/p&gt;&lt;p&gt;In small cities — those with populations under 300,000 — the share of paid, full days worked from home dropped to 27 percent this spring from around 42 percent in October 2020. In the 10 largest U.S. cities, days worked from home shifted to roughly 38 percent from 50 percent in that same\nperiod, according to a &lt;a href=&quot;https://wfhresearch.com/&quot; title target=&quot;_blank&quot;&gt;team&lt;/a&gt; of researchers at Stanford and other institutions led by the economists Steven Davis, Nick Bloom and Jose Maria Barrero.&lt;/p&gt;&lt;p&gt;Offices have filled back up fastest in areas where Covid lockdowns were shortest and where commutes are done by car, according to Mr. Davis. Many cities in California and New York, in particular, have been slower to return to the office than those in\nFlorida and Texas.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;“‘Strange’ is one word. ‘Jealousy’ is also one,” said Bret Hairston, an office worker in Columbus, describing her feelings about going into an office regularly while she knew many people were not.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;figure&gt;&lt;div&gt;&lt;p&gt;&lt;span&gt;Image&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;&lt;figcaption&gt;&lt;span&gt;&lt;span&gt;Credit...&lt;/span&gt;&lt;span&gt;&lt;span&gt;Ty Wright for The New York Times&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/figcaption&gt;\n&lt;/figure&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;While some company executives have found themselves embroiled in tense discussion about the future of the office, others are adamant that, at least for them, the debate is resolved. “In some ways, it’s a nonstory,” said Matt Lanter, 33, a co-founder of OpenStore, an e-commerce company in Miami whose 100 workers are in the office full time. “There’s nothing really to talk about because people have literally been in the office for the last one to two years.”&lt;/p&gt;&lt;/div&gt;&lt;div&gt;\n&lt;p&gt;It’s not that civic leaders everywhere don’t want people back. It’s just that their pitches are getting mixed results. “Downtown is back,” Andrew Ginther, the mayor of Columbus, said this spring. “Back to work, back to fun.” Mayor Eric Adams told New Yorkers, “You can’t stay home in your pajamas.” Yet many of them have.&lt;/p&gt;&lt;p&gt;The regional gap in return-to-office patterns is discernible in the share of online job postings that permit remote work. In San Francisco, 26 percent of job postings\nnow allow for remote work, and, in New York, 19 percent do. In Columbus, just 13 percent of job postings permit remote work; in Houston, the number is 12.6 percent, and in Birmingham, Ala., it is just 10.4 percent, according to another team of researchers led by Mr. Davis, Mr. Bloom and Raffaella Sadun of Harvard Business School.&lt;/p&gt;&lt;p&gt;Some workers are straddling the line between these two Americas. Ann Aly, who several years ago moved back from Alexandria, Va., to her hometown near Fort Myers,\nFla., is the only person she knows there who works remotely. She avoids driving anywhere between 7 and 9:30 a.m. because the waves of commuters make for interminable traffic. In the afternoons, she stops by the grocery store where she used to be a cashier, taking advantage of the short lines while others are at work.&lt;/p&gt;&lt;p&gt;“A lot of people don’t really understand how that works: How do you work remote? What do you do? And how do you not just take a nap in the middle of the day?” said Ms. Aly,\nwho works in tech. “I don’t really talk about it with neighbors unless they ask because I don’t necessarily want to highlight those social differences.”&lt;/p&gt;&lt;p&gt;Americans have always experienced the workplace in starkly different ways: Doctors spend long shifts on their feet, truckers on the road and knowledge workers hunched over computers. But now, even people within the same profession can have vastly different work arrangements depending on where their desks sit.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;figure&gt;&lt;div&gt;&lt;p&gt;&lt;span&gt;Image&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;&lt;figcaption&gt;&lt;span&gt;&lt;span&gt;Credit...&lt;/span&gt;&lt;span&gt;&lt;span&gt;Charity Rachelle for The New York Times&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/figcaption&gt;&lt;/figure&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;Gabe Tucker, 26, is a lawyer with Fortif Law Partners in Birmingham, Ala., where the share of job listings that permit remote work is roughly half that of New York’s. Each morning, Mr. Tucker puts on a button-down shirt,\ndrives for 15 minutes and arrives at the office around 8. His routine, in other words, remains identical to the one he had before the pandemic (with the exception of no longer having to wear a tie). In the evenings, he and his colleagues sometimes make a toast to celebrate the closing of a deal. They’ve been back in the office since June 2020, with masks and other Covid precautions.&lt;/p&gt;&lt;p&gt;“It’s work like normal, pretty much,” Mr. Tucker said. “We found it difficult to be working remotely. We all\nenjoy being around each other.”&lt;/p&gt;&lt;p&gt;San Francisco’s office occupancy is at 39 percent of its prepandemic level, and New York’s is at 41 percent, according to data from the building security firm Kastle. Austin, Texas, meanwhile, is at nearly 60 percent. Then there’s the Huntington Center, a 37-story office tower in downtown Columbus, which now has about 85 percent of its prepandemic occupants on site at some point during the week, according to Hines, the company that manages the building.&lt;/p&gt;\n&lt;p&gt;Traci Martinez, the office managing partner at Squire Patton Boggs, a law firm with offices on the 20th floor of the Huntington Center, said somebody coming from San Francisco might walk into her office and marvel at the buzz.&lt;/p&gt;&lt;p&gt;“They would come into our building and be like, ‘Wow, this is just normal,’” said Ms. Martinez, 45.&lt;/p&gt;&lt;p&gt;She has a front-row view of the disparities in office returns nationwide. She coordinates with managers in the firm’s numerous offices, and has found that its\nOhio locations have filled up faster than many others, particularly its Washington, D.C., location.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;figure&gt;&lt;div&gt;&lt;p&gt;&lt;span&gt;Image&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;&lt;figcaption&gt;&lt;span&gt;&lt;span&gt;Credit...&lt;/span&gt;&lt;span&gt;&lt;span&gt;Ty Wright for The New York Times&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/figcaption&gt;&lt;/figure&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;One recent Monday morning found Ms. Martinez and her assistant chuckling as they debriefed a dinner party they had\nhosted two days earlier for 45 of the firm’s lawyers.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;Since May 2020, Ms. Martinez had been back in the office five days a week — for her, it felt as if remote work had never really existed. “My husband will tell you I only lasted 10 days,” she said. “I just feel better when I’m in the office.”&lt;/p&gt;&lt;p&gt;She watches as she is being joined by more and more people: Commuters used to have their pick of parking spots, but now there is more competition. Robert Tannous, a lawyer who works\nin the building, said the time of his commute had gone up by at least five minutes because of increased traffic. Even lesser holidays draw crowds into common areas around the building. Porter Wright Morris &amp;amp; Arthur, another law firm in the Huntington Center, celebrated Pi Day not long ago by handing out cream-and-berry pies to its staff members.&lt;/p&gt;&lt;p&gt;Some executives argue that zeal over returning to the office can build on itself, with occupants begetting more occupants. It is difficult to\nfeel motivated to take on a commute when the destination is an abandoned workplace. When workers know they’ll see their teammates, the hassle of leaving home is easier to justify.&lt;/p&gt;&lt;p&gt;“People talk, and it’s like, ‘Oh, yeah, we’re all going to the office,’” said Mike Shebat, 30, the chief executive of Traba, an online labor marketplace whose 27 employees are in the office in Miami five days a week. “Sometimes even six days a week just because people want to come in on the weekends,” he said.\n“We have snacks here. It’s really good internet.”&lt;/p&gt;&lt;p&gt;Recruiters said these regional differences in office attendance and flexible work were making for a bumpier job market. Andy Challenger, the head of sales and media at the job search firm Challenger, Gray &amp;amp; Christmas, said he had to be newly attuned to a client’s location. He tends to warn job candidates in Texas that they should be prepared to work from an office, while he tells job candidates in California that they are more likely to\nbe able to work from home. Applicants interested in leadership roles might have to be prepared to take the lead on return-to-office plans by showing up every day.&lt;/p&gt;&lt;p&gt;Design and human resources firms are also wrestling with a newly complicated assortment of client needs. For example, managers at Gensler, the architecture and design firm, have to ask clients how much they intend to use their offices so that designers know whether to create a retreat-like environment or a typical corporate\nspace.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;“There’s always been dramatic differences in what people’s work lives looked like, but where they were consistent was with professional service workers,” said Joe Du Bey, who runs Eden, a company that makes human resources software. “Now we’re seeing this dramatic divergence of work experience for information workers.”&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;Some researchers worry that different expectations about workplace flexibility make for one more way that people’s lives have become\npolarized during the pandemic.&lt;/p&gt;&lt;p&gt;“One of the things that tethers us is having to go into work,” said Mr. Bloom, a professor at Stanford who studies hybrid work, explaining that for some people workplaces no longer serve as a social anchor. “Half the country has a different experience than the other.”&lt;/p&gt;&lt;p&gt;Mr. Bloom argues that the disparities in work experiences mean that people have less exposure to colleagues of different backgrounds, noting the mix of political perspectives in his own\nworkplace. “If you say, ‘We’re going to allow a bunch of folks to fully work from home,’ they’re no longer exposed to the guy on the other side of the table,” he said.&lt;/p&gt;&lt;p&gt;To the segment of the country that is fully back at the table with teammates, the debates being waged in other cities — over postponed office-return dates and permanent work-from-home arrangements — can feel distant.&lt;/p&gt;&lt;p&gt;“We don’t officially take attendance or anything, but yesterday I actually did walk around and count\neveryone just because I was like, gosh, this place is really, really full,” said Bill Nolan, 60, the office managing partner in Columbus of the law firm Barnes &amp;amp; Thornburg, which is on the Huntington Center’s 33rd floor. “You certainly don’t have any sense that it’s some ghost town.”&lt;/p&gt;&lt;/div&gt;&lt;/section&gt;&lt;/article&gt;",
    "author": "",
    "source": "nytimes.com",
    "published": "2022-08-01T20:39:08.000Z",
    "ttr": 390
  } 