{
    "url": "https://www.coindesk.com/layer2/2022/08/09/as-government-takes-on-the-tornado-mixer-it-may-reap-a-whirlwind/",
    "title": "As Government Takes on the Tornado Mixer, It May Reap a Whirlwind",
    "description": "David Z. Morris is CoinDesk's Chief Insights Columnist. He holds Bitcoin, Ethereum, and small amounts of other crypto assets. In the late 15th century, in what is now Germany, a monk wrote a book about magic....",
    "links": [
      "https://www.coindesk.com/layer2/2022/08/09/as-government-takes-on-the-tornado-mixer-it-may-reap-a-whirlwind/",
      "https://www.coindesk.com/layer2/2022/08/09/as-government-takes-on-the-tornado-mixer-it-may-reap-a-whirlwind/?outputType=amp"
    ],
    "image": "https://www.coindesk.com/resizer/0FQg16liEVw3VyQ-Alwfk2roGOM=/1200x600/center/top/cloudfront-us-east-1.images.arcpublishing.com/coindesk/BXNMPGO6XZALPEHKU3F7DPEYDY.jpg",
    "content": "&lt;div&gt;&lt;div&gt;&lt;div&gt;&lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/author/DavidMorris/&quot;&gt;&lt;p&gt;&lt;img src=&quot;https://s3.amazonaws.com/arc-authors/coindesk/02b3d252-c966-4a14-9258-b37351affb82.jpg&quot; alt=&quot;CoinDesk - Unknown&quot; /&gt;&lt;/p&gt;&lt;/a&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;David Z. Morris is CoinDesk&#039;s Chief Insights Columnist. He holds Bitcoin, Ethereum, and small amounts of other crypto assets.&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt;&lt;p&gt;In the late 15th century, in what is now Germany, a monk wrote a book about magic.&lt;/p&gt;&lt;/div&gt;\n&lt;div&gt;&lt;p&gt;It was not actually about magic.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;The three-volume “Steganographia,” authored by the Benedictine abbot Johannes Trithemius, described the use of spirits to communicate secretly over long distances. Trithemius was suspected of black magic, and the Catholic Church added “Steganographia” to its list of forbidden books, the Index Librorum Prohibitorum, where it would remain until 1900.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;&lt;i&gt;&lt;b&gt;This article is excerpted from The Node, CoinDesk&#039;s daily roundup of\nthe most pivotal stories in blockchain and crypto news. You can subscribe to get the full &lt;/b&gt;&lt;/i&gt;&lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/newsletters/&quot;&gt;&lt;i&gt;&lt;b&gt;newsletter here&lt;/b&gt;&lt;/i&gt;&lt;/a&gt;&lt;i&gt;&lt;b&gt;.&lt;/b&gt;&lt;/i&gt;&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;But the Church may not have blacklisted Trithemius’ work out of fear of spiritual corruption, for the “Steganographia” was not what it seemed. Though it spoke of angels and spirits, its real subject was far more dangerous: encryption.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;Written in 1499,\n“Steganographia” is one of the first major works on cryptography in the West, introducing, for instance, the now-widespread idea of a simple cipher that could replace the letters of a message systematically. Among others, the book uses what’s known as the “Ave Maria” cipher, replacing each letter of a message with a short Latin sentence about Jesus. It is now widely suspected the book’s blacklisting had little to do with religion but was an attempt to suppress knowledge of cryptography. (I tell\nthis story in more depth in my 2018 book&lt;a target=&quot;_blank&quot; href=&quot;https://www.amazon.com/Bitcoin-Magic-Internet-Memetic-Warfare-ebook/dp/B07YXH973Y&quot;&gt; “Bitcoin Is Magic&lt;/a&gt;.”)&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;You can likely imagine how threatening a looming explosion of concealed written messages would have been to the various warlords and strongmen who ruled Europe at the time (more than a few of them wearing church garb). The theology of\nthe&lt;a target=&quot;_blank&quot; href=&quot;https://en.wikipedia.org/wiki/Divine_right_of_kings&quot;&gt; divine right of kings&lt;/a&gt; held up by Trithemius’ church implied that most people didn’t have the right to any privacy, or to much of anything else.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;A half-millennium later, another Index Librorum Prohibitorum has been trotted out by a powerful governing force. Monday, the U.S. Office of Foreign Assets Control (OFAC) placed\na&lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/policy/2022/08/08/crypto-mixing-service-tornado-cash-blacklisted-by-us-treasury/&quot;&gt; decentralized privacy service called Tornado Cash&lt;/a&gt; on its Specially Designated Nationals list. This makes interacting with the service illegal for U.S. nationals and entities.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;But the impact and even intent seem even broader than that: Tornado Cash developer Roman Semenov claimed Tuesday his Github code repository\naccount&lt;a target=&quot;_blank&quot; href=&quot;https://twitter.com/semenov_roman_/status/1556717890308653059&quot;&gt; had been suspended&lt;/a&gt;. Semenov has not personally been sanctioned by OFAC, and he plays no direct role in the Tornado Cash service. Instead, he has coordinated the creation of code that can be run by other people to form a decentralized network. Writing on Twitter, Semenov nailed the key question raised by his reported suspension:&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;“Is writing open-source code illegal now?”&lt;/p&gt;&lt;/div&gt;\n&lt;div&gt;&lt;p&gt;&lt;/p&gt;&lt;h2&gt;What is Tornado Cash?&lt;/h2&gt;&lt;p&gt;&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;&lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/policy/2022/08/08/us-government-amps-up-inevitable-clash-with-crypto-privacy-in-tornado-cash-blacklisting/&quot;&gt;Tornado Cash&lt;/a&gt; is a “mixer” on the Ethereum network. In broad strokes, it allows Ethereum users to send either ether (ETH) or ERC-20 tokens to the service to be “mixed” with other users’ tokens before being sent back, helping obscure who sent what to who and when. While\nEthereum has basically nonexistent privacy controls by default, Tornado Cash is apparently quite effective – if it wasn’t, OFAC might not have bothered blacklisting it. And because the code is transparent, decentralized and automated, Tornado Cash can be trusted to do what it says on the tin.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;OFAC has very legitimate reasons for wishing Tornado Cash didn’t exist. According to the agency, Tornado was used by North Korea’s Lazarus Group to launder hundreds of millions of dollars\nof proceeds from the hacks of huge crypto projects including&lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/tech/2022/03/29/axie-infinitys-ronin-network-suffers-625m-exploit/&quot;&gt; the Ronin bridge&lt;/a&gt;. It has been suggested that North Korea uses the proceeds from such hacks to fund weapons programs, so stopping that seems like it would be pretty good for the world.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;But OFAC’s sanction is itself an indiscriminate dirty bomb of catastrophic proportions, poised to vaporize the\nfundamental human rights of millions of people globally as it (maybe) stops the activities of one tiny and impoverished nation. There are innumerable reasons for everyday non-criminals to use a service like Tornado Cash, from making anonymous political donations to concealing the extent or location of their private wealth.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;Even Ethereum co-founder Vitalik Buterin jumped into the discussion to admit he had used Tornado Cash to obfuscate donations to the Ukraine war effort – not,\nhe claims, to protect himself, but to protect recipients in Ukraine.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;figure&gt;&lt;img src=&quot;https://cloudfront-us-east-1.images.arcpublishing.com/coindesk/DXL6VFVSONCIREBVZP3D7HOCKI.png&quot; alt=&quot;CoinDesk - Unknown&quot; /&gt;&lt;figcaption&gt;&lt;/figcaption&gt;&lt;/figure&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;This is a problem not just ethically, but legally. OFAC’s sanction, and even more so subsequent attempts by the likes of Github to squelch the Tornado Cash code, may point to intense internal contradictions in U.S.\nlaw. It’s not quite fair to blame OFAC singularly for this: A regulator’s job is, generally, to attack a single problem rather than to think through the broader consequences.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;Responsibility for the big picture falls instead mostly to legislators and, particularly in this case, the judiciary.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;&lt;/p&gt;&lt;h2&gt;Is code speech?&lt;/h2&gt;&lt;p&gt;&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;From a legal standpoint, understanding what Tornado Cash does may be less important than understanding what it is. It is not\na company or a human or even a machine with a physical presence. It is open-source code – text, commands, numbers and words – that executes a certain scheme of commands when compiled and deployed in its intended environment.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;Tornado Cash, then, is a network of peer-to-peer channels, rather than a discrete company, entity or service. So while the sanctioning document targets Tornado Cash by name, and lays out a series of specific Ethereum addresses associated with it, the code\ncould in principle be redeployed under a different name and utilizing different addresses. It seems likely this would set up a kind of “whack-a-mole” situation as new iterations of Tornado Cash are sanctioned as quickly as they appear.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;That could hint at why someone may have leaned on Github owner Microsoft (MSFT) to ban Semenov. The real threat here isn’t the operational Tornado Cash service on Ethereum, but the infinitely and freely replicable code that makes it work.&lt;/p&gt;\n&lt;/div&gt;&lt;div&gt;&lt;p&gt;That means OFAC faces a serious constitutional challenge in trying to quash it: As the Washington, D.C., lobbying group Coin Center has pointed out, various legal judgments have concluded that both money and computer code can be forms of speech&lt;a target=&quot;_blank&quot; href=&quot;https://www.coincenter.org/u-s-treasury-sanction-of-privacy-tools-places-sweeping-restrictions-on-all-americans/&quot;&gt; protected by the First Amendment&lt;/a&gt;. In the case of money, that seems to particularly apply\nto&lt;a target=&quot;_blank&quot; href=&quot;https://www.brennancenter.org/our-work/research-reports/citizens-united-explained&quot;&gt; monetary political donations&lt;/a&gt;.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;That puts Semenov in the company of both Johannes Trithemius and, more recently, Phil Zimmerman, the inventor of&lt;a target=&quot;_blank&quot; href=&quot;https://www.wired.com/1994/11/cypher-wars/&quot;&gt; PGP encryption&lt;/a&gt;, an effectively unbreakable public-key encryption scheme. Zimmerman released PGP in 1991, declaring it “guerrilla freeware.” But within\nmonths the National Security Agency had&lt;a target=&quot;_blank&quot; href=&quot;https://reason.com/video/2020/10/21/cryptowars-gilmore-zimmermann-cryptography/&quot;&gt; declared PGP a sanctioned “munition”&lt;/a&gt; so dangerous for warfare that it should not be legally distributed.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;Zimmerman fought a multi-year legal battle before two federal court decisions in 1996 declared that the encryption techniques were protected by the First Amendment. It seems plausible that a similar conclusion might be reached\nby courts considering OFAC’s actions against the Tornado Cash code.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;This is a fundamental dilemma for the U.S., and even for global jurisprudence and social structure. There are very good reasons to not want North Korea or anyone else to be able to freely conceal global financial activity.&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;But is doing so worth sacrificing the values America purports to stand for?&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;div&gt;&lt;hr /&gt;&lt;p&gt;&lt;/p&gt;Read more about&lt;p&gt;&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;hr /&gt;&lt;p&gt;&lt;/p&gt;Sign up for Crypto Long &amp;amp; Short, our weekly newsletter featuring insights, news and analysis for the professional investor.&lt;p&gt;&lt;/p&gt;&lt;p&gt;&lt;span&gt;By signing up, you will receive emails about CoinDesk product updates, events and marketing and you agree to our &lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/terms/&quot;&gt;terms of services&lt;/a&gt; and &lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/privacy/&quot;&gt;privacy\npolicy&lt;/a&gt;.&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;DISCLOSURE&lt;/p&gt;&lt;div&gt;&lt;p&gt;Please note that our &lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/privacy/&quot;&gt;privacy policy&lt;/a&gt;, &lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/terms/&quot;&gt;terms of use&lt;/a&gt;, &lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/privacy/#cookies&quot;&gt;cookies&lt;/a&gt;, and &lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/privacy/#dnsmpi&quot;&gt;do not sell my personal information&lt;/a&gt; has been updated.&lt;/p&gt;&lt;p&gt;The leader in news and information on\ncryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a &lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/ethics/&quot;&gt;strict set of editorial policies&lt;/a&gt;. CoinDesk is an independent operating subsidiary of &lt;a href=&quot;https://dcg.co/&quot; target=&quot;_blank&quot;&gt;Digital Currency Group&lt;/a&gt;, which invests in\n&lt;a href=&quot;https://dcg.co/#digital-assets-portfolio&quot; target=&quot;_blank&quot;&gt;cryptocurrencies&lt;/a&gt; and blockchain &lt;a href=&quot;https://dcg.co/portfolio/&quot; target=&quot;_blank&quot;&gt;startups&lt;/a&gt;. As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of &lt;a href=&quot;https://www.investopedia.com/terms/s/sar.asp&quot; target=&quot;_blank&quot;&gt;stock appreciation rights&lt;/a&gt;, which vest\nover a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG.&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;div&gt;&lt;div&gt;&lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/author/DavidMorris/&quot;&gt;&lt;p&gt;&lt;img src=&quot;https://s3.amazonaws.com/arc-authors/coindesk/02b3d252-c966-4a14-9258-b37351affb82.jpg&quot; alt=&quot;CoinDesk - Unknown&quot; /&gt;&lt;/p&gt;&lt;/a&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;David Z. Morris is CoinDesk&#039;s Chief Insights Columnist. He holds Bitcoin, Ethereum, and small amounts of other crypto assets.&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;/div&gt;&lt;div&gt;&lt;div&gt;&lt;a target=&quot;_blank&quot; href=&quot;https://www.coindesk.com/author/DavidMorris/&quot;&gt;&lt;p&gt;&lt;img src=&quot;https://s3.amazonaws.com/arc-authors/coindesk/02b3d252-c966-4a14-9258-b37351affb82.jpg&quot; alt=&quot;CoinDesk - Unknown&quot; /&gt;&lt;/p&gt;&lt;/a&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;David Z. Morris is CoinDesk&#039;s Chief Insights Columnist. He holds Bitcoin, Ethereum, and small amounts of other crypto assets.&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;",
    "author": "@coindesk",
    "source": "coindesk.com",
    "published": "2022-08-09T18:23:40.393Z",
    "ttr": 285
  } 